"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.numberTitles = void 0;
exports.numberTitles = [
    [
        '',
        'یک',
        'دو',
        'سه',
        'چهار',
        'پنچ',
        'شش',
        'هفت',
        'هشت',
        'نه',
        'ده',
        'یازده',
        'دوازده',
        'سیزده',
        'چهارده',
        'پانزده',
        'شانزده',
        'هفده',
        'هجده',
        'نوزده',
    ],
    ['', 'بیست', 'سی', 'چهل', 'پنجاه', 'شصت', 'هفتاد', 'هشتاد', 'نود'],
    ['', 'صد', 'دویست', 'سیصد', 'چهارصد', 'پانصد', 'ششصد', 'هفتصد', 'هشتصد', 'نهصد'],
    ['', 'هزار', 'میلیون', 'میلیارد', 'تریلیون', 'کادریلیون'],
    ['', 'دهم', 'صدم', 'هزارم'],
];
//# sourceMappingURL=number.js.map